; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-24)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city3)
	(fuel-level plane1 fl5)
	(at plane2 city2)
	(fuel-level plane2 fl5)
	(at plane3 city4)
	(fuel-level plane3 fl4)
	(at plane4 city0)
	(fuel-level plane4 fl0)
	(at person1 city3)
	(at person2 city2)
	(at person3 city1)
	(at person4 city1)
	(at person5 city0)
	(at person6 city3)
	(at person7 city0)
	(at person8 city2)
	(at person9 city1)
	(at person10 city0)
	(at person11 city0)
	(at person12 city3)
	(at person13 city0)
	(at person14 city0)
	(at person15 city0)
	(at person16 city3)
	(at person17 city0)
	(at person18 city3)
	(at person19 city2)
	(at person20 city2)
	(at person21 city3)
	(at person22 city1)
	(at person23 city2)
	(at person24 city3)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city3)
	(at person2 city2)
	(at person3 city0)
	(at person5 city4)
	(at person6 city4)
	(at person7 city1)
	(at person8 city2)
	(at person9 city1)
	(at person10 city1)
	(at person11 city0)
	(at person12 city3)
	(at person13 city0)
	(at person14 city1)
	(at person15 city1)
	(at person16 city4)
	(at person17 city0)
	(at person18 city2)
	(at person19 city4)
	(at person20 city4)
	(at person21 city0)
	(at person24 city4)
	))

)

; plan
1. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 21
2. (board person7 plane4 city0)
   deleted: (at person7 city0)
   added: (in person7 plane4)
   goals met: 8 of 21
3. (board person5 plane4 city0)
   deleted: (at person5 city0)
   added: (in person5 plane4)
   goals met: 8 of 21
4. (board person15 plane4 city0)
   deleted: (at person15 city0)
   added: (in person15 plane4)
   goals met: 8 of 21
5. (board person14 plane4 city0)
   deleted: (at person14 city0)
   added: (in person14 plane4)
   goals met: 8 of 21
6. (fly plane4 city0 city1 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 8 of 21
7. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 21
8. (debark person7 plane4 city1)
   deleted: (in person7 plane4)
   added: (at person7 city1)
   goals met: 9 of 21
9. (board person3 plane4 city1)
   deleted: (at person3 city1)
   added: (in person3 plane4)
   goals met: 9 of 21
10. (debark person15 plane4 city1)
   deleted: (in person15 plane4)
   added: (at person15 city1)
   goals met: 10 of 21
11. (debark person14 plane4 city1)
   deleted: (in person14 plane4)
   added: (at person14 city1)
   goals met: 11 of 21
12. (board person20 plane2 city2)
   deleted: (at person20 city2)
   added: (in person20 plane2)
   goals met: 11 of 21
13. (board person19 plane2 city2)
   deleted: (at person19 city2)
   added: (in person19 plane2)
   goals met: 11 of 21
14. (zoom plane2 city2 city4 fl5 fl4 fl3)
   deleted: (at plane2 city2) (fuel-level plane2 fl5)
   added: (at plane2 city4) (fuel-level plane2 fl3)
   goals met: 11 of 21
15. (debark person20 plane2 city4)
   deleted: (in person20 plane2)
   added: (at person20 city4)
   goals met: 12 of 21
16. (debark person19 plane2 city4)
   deleted: (in person19 plane2)
   added: (at person19 city4)
   goals met: 13 of 21
17. (board person6 plane1 city3)
   deleted: (at person6 city3)
   added: (in person6 plane1)
   goals met: 13 of 21
18. (board person24 plane1 city3)
   deleted: (at person24 city3)
   added: (in person24 plane1)
   goals met: 13 of 21
19. (board person21 plane1 city3)
   deleted: (at person21 city3)
   added: (in person21 plane1)
   goals met: 13 of 21
20. (board person18 plane1 city3)
   deleted: (at person18 city3)
   added: (in person18 plane1)
   goals met: 13 of 21
21. (zoom plane1 city3 city0 fl5 fl4 fl3)
   deleted: (at plane1 city3) (fuel-level plane1 fl5)
   added: (at plane1 city0) (fuel-level plane1 fl3)
   goals met: 13 of 21
22. (debark person21 plane1 city0)
   deleted: (in person21 plane1)
   added: (at person21 city0)
   goals met: 14 of 21
23. (zoom plane1 city0 city4 fl3 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city4) (fuel-level plane1 fl1)
   goals met: 14 of 21
24. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   goals met: 15 of 21
25. (debark person24 plane1 city4)
   deleted: (in person24 plane1)
   added: (at person24 city4)
   goals met: 16 of 21
26. (fly plane1 city4 city2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 16 of 21
27. (zoom plane2 city4 city0 fl3 fl2 fl1)
   deleted: (at plane2 city4) (fuel-level plane2 fl3)
   added: (at plane2 city0) (fuel-level plane2 fl1)
   goals met: 16 of 21
28. (board person10 plane2 city0)
   deleted: (at person10 city0)
   added: (in person10 plane2)
   goals met: 16 of 21
29. (zoom plane3 city4 city3 fl4 fl3 fl2)
   deleted: (at plane3 city4) (fuel-level plane3 fl4)
   added: (at plane3 city3) (fuel-level plane3 fl2)
   goals met: 16 of 21
30. (board person16 plane3 city3)
   deleted: (at person16 city3)
   added: (in person16 plane3)
   goals met: 16 of 21
31. (zoom plane3 city3 city4 fl2 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl2)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 16 of 21
32. (debark person16 plane3 city4)
   deleted: (in person16 plane3)
   added: (at person16 city4)
   goals met: 17 of 21
33. (fly plane2 city0 city1 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 17 of 21
34. (debark person10 plane2 city1)
   deleted: (in person10 plane2)
   added: (at person10 city1)
   goals met: 18 of 21
35. (debark person18 plane1 city2)
   deleted: (in person18 plane1)
   added: (at person18 city2)
   goals met: 19 of 21
36. (fly plane4 city1 city0 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 19 of 21
37. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 19 of 21
38. (debark person3 plane4 city0)
   deleted: (in person3 plane4)
   added: (at person3 city0)
   goals met: 20 of 21
39. (fly plane4 city0 city4 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 20 of 21
40. (debark person5 plane4 city4)
   deleted: (in person5 plane4)
   added: (at person5 city4)
   goals met: 21 of 21
